#+title: Lecture 4: Statistical inference
#+author: Daniel Ballesteros-Chávez
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.1 (Org mode 9.3.6)
#+PROPERTY: header-args :R+ :exports both
#+PROPERTY: header-args :R+ :session *R*
#+HTML_HEAD: <style type="text/css"> tr:nth-child(odd) {background-color: #e2e2e2;}  tr:first-child {font-weight: bold}  tr:hover {background-color: #d0c6e5;}</style>
#+HTML_HEAD_EXTRA: <style>code {background-color: #ccc}</style>
:results:
#+HTML_HEAD:<style>
#+HTML_HEAD:/* Daniel Ballesteros-Chavez */
#+HTML_HEAD:/* DBCh CSS for blog project */
#+HTML_HEAD:/* color schemes: #333745; #E63462 ; #C7EFCF ; #EEF5DB ; #909396; #262626;*/
#+HTML_HEAD:/* Modified version with responsive TOC
#+HTML_HEAD:
#+HTML_HEAD:/* usage: #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style01.css"/> */
#+HTML_HEAD:
#+HTML_HEAD:body {
#+HTML_HEAD:	font-size: 18px;
#+HTML_HEAD:	color: #404040;
#+HTML_HEAD:	/* background-color: #333745; */
#+HTML_HEAD:	font-family: Helvetica;
#+HTML_HEAD:	line-height: 1.3;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:#content {
#+HTML_HEAD:	max-width: 50em;
#+HTML_HEAD:	margin-left: auto;
#+HTML_HEAD:	margin-right: auto;
#+HTML_HEAD:    padding: 15px 50px 50px 15px;
#+HTML_HEAD:    background-color: #E4F7FF;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:p {
#+HTML_HEAD:		text-align: justify;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:
#+HTML_HEAD:/* this part is about the table of contents TOC */
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents a:link,
#+HTML_HEAD:#table-of-contents a:visited {
#+HTML_HEAD:    color: #404040;
#+HTML_HEAD:    background: transparent;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents a:hover {
#+HTML_HEAD:  background-color: #ccc;
#+HTML_HEAD:  color: #404040;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents {
#+HTML_HEAD:    line-height: 1.2;
#+HTML_HEAD:}
#+HTML_HEAD:
#+HTML_HEAD:#table-of-contents h2 {
* The central limit theorem

The Central Limit Theorem of probability states that the sum of many
small independent random variables will be a random variable with an
approximate normal distribution.


For example, the heights of women in the United States follow an approximate
normal distribution. The Central Limit Theorem applies here because height is
affected by many small additive factors. In contrast, the distribution of heights
of all adults in the United States is not so close to normality. The Central Limit
Theorem does not apply here because there is a single large factor—sex—that
represents much of the total variation.

Example 1. Uniform distribution. 

A. Take five uniformly distributed random numbers between 0 and 10 and work out the
average.

#+begin_src R
mean(runif(5,0,10))
#+end_src

#+RESULTS:
: 3.94939380558208

Typically, of course, the average will be close to 5.

B. Let us do this 10,000 times and look at the distribution of the 10,000
means.

#+begin_example R

#Distribution of the raw data
runif(10000,0,10))

#Distribution of the means
means <- numeric(10000)
for (i in 1:10000){
means[i] <- mean(runif(5,0,10))
}

hist(means)
#+end_example

Now let's take a look at the normal distribution

#+begin_example R
mm  <- mean(means)
ssdd <-  sd(means)
xx  <-  seq(0,10,0.1)
yy  <-  dnorm(xx, mm, ssdd)

plot(xx,yy)
#+end_example

The height that gives the right scale, depends on the chosen bin widths, note that if we doubled with width of the bin there would be (close to) twice
as many numbers in the bin and the bar would be in principle twice as high too. Then get the height of the bars
on our frequency scale we multiply the total frequency, 10 000 by the bin width, 0.5 to get 5000.

#+begin_example R
hist(means)
lines(xx,yy*5000)
#+end_example

